<a href="https://colab.research.google.com/github/ustab/NOTES-FROM-LECTURERS/blob/main/BESVEALTI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

In [ ]:
df = pd.DataFrame(np.random.randint(0, 100, size=(7, 7)), 
                  columns=["x1", "x2", "x3", "x4", "x5","x6",'x7'])
df

   x1  x2  x3  x4  x5  x6  x7
0  44  55  77  70  98  62  78
1  65  14  13  32  94  83  71
2  18  99  35  74  35  90  63
3   1  40  20  41  38  84  32
4  53  59  60  37  97   7  44
5  35  49  43  92  46  16  42
6  50  54  59  34  90  31  45

In [ ]:
df.count()

x1    7
x2    7
x3    7
x4    7
x5    7
x6    7
X7    7
dtype: int64

In [ ]:
df.x7.count()

7

In [ ]:
df.mean()
df.median()

x1    44.0
x2    54.0
x3    43.0
x4    41.0
x5    90.0
x6    62.0
x7    45.0
dtype: float64

In [ ]:
df.min()

x1     1
x2    14
x3    13
x4    32
x5    35
x6     7
x7    32
dtype: int32

In [ ]:
df.max()

x1    65
x2    99
x3    77
x4    92
x5    98
x6    90
x7    78
dtype: int32

In [ ]:
df.idxmax()# max deger hangi sutunun hangi indexinde

x1    1
x2    2
x3    0
x4    5
x5    0
x6    2
x7    0
dtype: int64

In [ ]:
df.std()

x1    22.030282
x2    25.373402
x3    23.053767
x4    23.949351
x5    29.734540
x6    34.831568
x7    17.096366
dtype: float64

In [ ]:
df[['x1','x2','x3','x4']].std()

x1    22.030282
x2    25.373402
x3    23.053767
x4    23.949351
dtype: float64

In [ ]:
df.sum()

x1    266
x2    370
x3    307
x4    380
x5    498
x6    373
x7    375
dtype: int64

In [ ]:
df.sum(axis=0)#sutunlarin toplami

x1    266
x2    370
x3    307
x4    380
x5    498
x6    373
x7    375
dtype: int64

In [ ]:
df.sum(axis=1)#satirlarin toplami

0    484
1    372
2    414
3    256
4    357
5    323
6    363
dtype: int64

In [ ]:
df.describe().T

    count       mean        std   min   25%   50%   75%   max
x1    7.0  38.000000  22.030282   1.0  26.5  44.0  51.5  65.0
x2    7.0  52.857143  25.373402  14.0  44.5  54.0  57.0  99.0
x3    7.0  43.857143  23.053767  13.0  27.5  43.0  59.5  77.0
x4    7.0  54.285714  23.949351  32.0  35.5  41.0  72.0  92.0
x5    7.0  71.142857  29.734540  35.0  42.0  90.0  95.5  98.0
x6    7.0  53.285714  34.831568   7.0  23.5  62.0  83.5  90.0
x7    7.0  53.571429  17.096366  32.0  43.0  45.0  67.0  78.0

In [ ]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'GOOG', 'MSFT', 'GOOG', 'MSFT'],
        'Department':['HR', 'IT', 'IT', 'HR', 'HR', 'IT', 'IT', 'HR'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah', 'Tom', 'Terry'],
        'Age':[30, 28, 35, 40, 42, 25, 32, 48],
        'Sales':[200, 120, 340, 124, 243, 350, 180, 220]}

In [ ]:
df1 = pd.DataFrame(data)
df1

  Company Department   Person  Age  Sales
0    GOOG         HR      Sam   30    200
1    GOOG         IT  Charlie   28    120
2    MSFT         IT      Amy   35    340
3    MSFT         HR  Vanessa   40    124
4    GOOG         HR     Carl   42    243
5    MSFT         IT    Sarah   25    350
6    GOOG         IT      Tom   32    180
7    MSFT         HR    Terry   48    220

In [ ]:
df1.groupby('Person')['Sales'].max()

Person
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Terry      220
Tom        180
Vanessa    124
Name: Sales, dtype: int64

In [ ]:
df1.groupby('Company')['Sales'].count()

Company
GOOG    4
MSFT    4
Name: Sales, dtype: int64

In [ ]:
df1.groupby(['Company','Department','Person']).mean()

                            Age  Sales
Company Department Person
GOOG    HR         Carl      42    243
                   Sam       30    200
        IT         Charlie   28    120
                   Tom       32    180
MSFT    HR         Terry     48    220
                   Vanessa   40    124
        IT         Amy       35    340
                   Sarah     25    350

In [ ]:
df1.groupby(['Department','Person']).mean()

                    Age  Sales
Department Person
HR         Carl      42    243
           Sam       30    200
           Terry     48    220
           Vanessa   40    124
IT         Amy       35    340
           Charlie   28    120
           Sarah     25    350
           Tom       32    180

In [ ]:
df1.groupby('Company')[['Sales']].mean().T

Company    GOOG   MSFT
Sales    185.75  258.5

In [ ]:
aaa=df1.groupby(['Department','Company']).describe()
aaa

                     Age                                               Sales  \
                   count  mean       std   min   25%   50%   75%   max count
Department Company
HR         GOOG      2.0  36.0  8.485281  30.0  33.0  36.0  39.0  42.0   2.0
           MSFT      2.0  44.0  5.656854  40.0  42.0  44.0  46.0  48.0   2.0
IT         GOOG      2.0  30.0  2.828427  28.0  29.0  30.0  31.0  32.0   2.0
           MSFT      2.0  30.0  7.071068  25.0  27.5  30.0  32.5  35.0   2.0


                     mean        std    min     25%    50%     75%    max
Department Company
HR         GOOG     221.5  30.405592  200.0  210.75  221.5  232.25  243.0
           MSFT     172.0  67.882251  124.0  148.00  172.0  196.00  220.0
IT         GOOG     150.0  42.426407  120.0  135.00  150.0  165.00  180.0
           MSFT     345.0   7.071068  340.0  342.50  345.0  347.50  350.0

In [ ]:
DataFrame.agg()
DataFrame.aggregate(func=None, axis=0, *args, **kwargs)

In [ ]:
df2 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]})
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df2.agg(['sum','min'])

        groups  var1  var2
sum  ABCABCABC   403  3771
min          A    10   100

In [ ]:
df2[['var1','var2']].agg([sum,min,max,])

     var1  var2
sum   403  3771
min    10   100
max    99   969

In [ ]:
df2.agg({"var1":sum,"var2":min}).T

var1    403
var2    100
dtype: int64

In [ ]:
df2.agg({"var1":[sum],"var2":[min]}).T

        sum    min
var1  403.0    NaN
var2    NaN  100.0

In [ ]:
df2.agg({"var1":[sum,np.mean],"var2":[min,max]}).T

        sum       mean    min    max
var1  403.0  44.777778    NaN    NaN
var2    NaN        NaN  100.0  969.0

In [ ]:
df2.groupby('groups').agg({np.min,np.median,np.max}).T

groups         A    B    C
var1 amin     10   11   33
     median   22   23   45
     amax     76   84   99
var2 amin    100  111  333
     median  262  253  760
     amax    405  578  969

In [ ]:
df2.groupby('groups').agg({min,'median',max}).T

groups         A    B    C
var1 min      10   11   33
     median   22   23   45
     max      76   84   99
var2 min     100  111  333
     median  262  253  760
     max     405  578  969

In [ ]:
df2.groupby('groups').agg({'var1':(min,'max'),'var2':['median','mean']}).T

groups                A      B           C
var1 min      10.000000   11.0   33.000000
     max      76.000000   84.0   99.000000
var2 median  262.000000  253.0  760.000000
     mean    255.666667  314.0  687.333333

In [ ]:
df2.filter(regex="^var", axis=1)

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
df2.filter(like='var', axis=1)#icinde var olan sutunlar geliyor

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
drf2.filter(like="5", axis=0)# 5 yazan satiri getir

NameError: name 'drf2' is not defined

In [ ]:
df2.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [ ]:
df2.groupby('groups').mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [ ]:
def filter_func(x):
    return x['var1'].mean()>39

In [ ]:
df2.groupby('groups').filter(filter_func)

  groups  var1  var2
1      B    23   253
2      C    33   333
4      B    11   111
5      C    99   969
7      B    84   578
8      C    45   760

In [ ]:
df2.groupby('groups').filter(lambda x:x["var2"].sum()<800)

  groups  var1  var2
0      A    10   100
3      A    22   262
6      A    76   405

In [ ]:
DataFrame.transform()

In [ ]:
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df_num=df2.iloc[:,1:3]
df_num

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [ ]:
df_num.transform(lambda x:x+15)

   var1  var2
0    25   115
1    38   268
2    48   348
3    37   277
4    26   126
5   114   984
6    91   420
7    99   593
8    60   775

In [ ]:
df_num+5000*2

    var1   var2
0  10010  10100
1  10023  10253
2  10033  10333
3  10022  10262
4  10011  10111
5  10099  10969
6  10076  10405
7  10084  10578
8  10045  10760

In [ ]:
df_num.var1.transform(np.sqrt)

0    3.162278
1    4.795832
2    5.744563
3    4.690416
4    3.316625
5    9.949874
6    8.717798
7    9.165151
8    6.708204
Name: var1, dtype: float64

In [ ]:
df_num.var1**0.5

0    3.162278
1    4.795832
2    5.744563
3    4.690416
4    3.316625
5    9.949874
6    8.717798
7    9.165151
8    6.708204
Name: var1, dtype: float64

In [ ]:
df_num.var1.transform([np.sqrt, np.exp])

       sqrt           exp
0  3.162278  2.202647e+04
1  4.795832  9.744803e+09
2  5.744563  2.146436e+14
3  4.690416  3.584913e+09
4  3.316625  5.987414e+04
5  9.949874  9.889030e+42
6  8.717798  1.014800e+33
7  9.165151  3.025077e+36
8  6.708204  3.493427e+19

In [ ]:
df2.groupby('groups')['var1'].mean()

groups
A    36.000000
B    39.333333
C    59.000000
Name: var1, dtype: float64

In [ ]:
df3 = pd.DataFrame({'col1':[1, 2, 3, 4],
                    'col2':[444, 555, 666, 444],
                    'col3':['abc', 'def', 'ghi', 'xyz']})
df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df3['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [ ]:
df3['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [ ]:
def squared(x):
 return x**2
df3['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [ ]:
df3['col2'].apply(np.log10)

0    2.647383
1    2.744293
2    2.823474
3    2.647383
Name: col2, dtype: float64

In [ ]:
df3['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df3['col3'].apply(lambda x:x[0]*3)

0    aaa
1    ddd
2    ggg
3    xxx
Name: col3, dtype: object

In [ ]:
df3['col2'].apply(lambda x : 'high' if x>500 else 'low')

0     low
1    high
2    high
3     low
Name: col2, dtype: object

In [ ]:
df2=df2[["groups","var1","var2"]]
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df2=df2[["groups","var1","var2"]]
df2

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [ ]:
df2.apply(np.min)

groups      A
var1       10
var2      100
dtype: object

In [ ]:
#df_num.apply(np.sum, axis=0)
df.apply(np.sum, axis=1)

0    484
1    372
2    414
3    256
4    357
5    323
6    363
dtype: int64

In [ ]:
df_num.apply(lambda x:(x+2)**0.5)

        var1       var2
0   3.464102  10.099505
1   5.000000  15.968719
2   5.916080  18.303005
3   4.898979  16.248077
4   3.605551  10.630146
5  10.049876  31.160873
6   8.831761  20.174241
7   9.273618  24.083189
8   6.855655  27.604347

In [ ]:
df2.groupby('groups').mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [ ]:
df2.groupby('groups').apply(np.mean)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [ ]:
df_num.applymap(lambda x:x*5)

   var1  var2
0    50   500
1   115  1265
2   165  1665
3   110  1310
4    55   555
5   495  4845
6   380  2025
7   420  2890
8   225  3800

In [ ]:
df_num.applymap(lambda x:len(str(x)))

   var1  var2
0     2     3
1     2     3
2     2     3
3     2     3
4     2     3
5     2     3
6     2     3
7     2     3
8     2     3

In [ ]:
df2.groupby('groups').mean().applymap(np.sum)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333